InformationRegisters/ПроверкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ПроверкиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипРезультатаПроверкиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кластеры1С</v8:Type>
						<v8:Type>cfg:CatalogRef.СерверыБД</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПользователиИБ</v8:Type>
						<v8:Type>cfg:CatalogRef.ВебСерверы</v8:Type>
						<v8:Type>cfg:CatalogRef.ХранилищаКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверкиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/МониторингСостоянияОбъектов/Ext/Module.bsl
// @strict-types


#Область ПрограммныйИнтерфейс

Процедура ПроверитьАктуальностьЗарегистрированныхБаз(Кластер, ИдентификаторыБаз) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	ИнформационныеБазы.Ссылка КАК ИнформационнаяБаза
				|ИЗ
				|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
				|ГДЕ
				|	НЕ ИнформационныеБазы.ИдентификаторБазы В (&ИдентификаторыБаз)
				|	И ИнформационныеБазы.Владелец = &Кластер1С";
	
	Запрос.УстановитьПараметр("Кластер1С",				Кластер);
	Запрос.УстановитьПараметр("ИдентификаторыБаз",	ИдентификаторыБаз);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Правило = Справочники.ПравилаПроверкиОбъектов.РегистрацияИнформационнойБазы;
	
	Пока Выборка.Следующий() Цикл
		ЗаписатьРезультатПроверки(Выборка.ИнформационнаяБаза, Правило);		
	КонецЦикла;
		
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


// Записать результат проверки.
// 
// Параметры:
//  Объект - СправочникСсылка.Кластеры1С  
//			 - СправочникСсылка.ИнформационныеБазы
//  		 - 	СправочникСсылка.СерверыБД
//  		 - 	СправочникСсылка.ПользователиИБ
//  		 - 	СправочникСсылка.ВебСерверы
//  		 - 	СправочникСсылка.ХранилищаКонфигураций - Объект информацио о проверке которого записывается
//  		 
//  Правило - СправочникСсылка.ПравилаПроверкиОбъектов - Правило
Процедура ЗаписатьРезультатПроверки(Объект, Правило) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.ПроверкиОбъектов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Объект	= Объект;
	ЗаписьРегистра.Правило	= Правило;
	ЗаписьРегистра.Записать(Истина);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
